# SQL Training


* PostgreSQL Cheat Sheet<br>
https://www.postgresqltutorial.com/postgresql-cheat-sheet/

* CHAR, VARCHAR, TEXT<br>
https://www.postgresqltutorial.com/postgresql-char-varchar-text/

* PSQL 
https://www.postgresql.org/docs/14/app-psql.html

## Check your conda environment

In [2]:
!conda env list

# conda environments:
#
base                     C:\Users\rb\Anaconda3
dash                     C:\Users\rb\Anaconda3\envs\dash
geo                      C:\Users\rb\Anaconda3\envs\geo
geo2                  *  C:\Users\rb\Anaconda3\envs\geo2
dash                     C:\users\rb\Anaconda3\envs\dash

## PSQL Command Line Interface

### Connect to your manangement database named `postgres`

A previous installation of PostgreSQL is required.<br>
During installation you should have been asked for the database admin master **password** (user postgres). I hope you still remember it.<br>

Open the **Anaconda Power Shell** (command window). **Activate** the geo environment.<br>
Use the command line interface `psql` to **connect** to the database named postgres. <br>
On the Anaconda prompt call:

psql --host=localhost --port=5432 --dbname=postgres --username=postgres

This connects the **user** `postgres` (the super admin!) to the **database** named `postgres` on your **local** computer `localhost`.
<br>
Type in the correct master password.
<br>
This should bring you to the interactive psql CLI.

Command line parameters usually have a short form, too. 
<br>You can replace `--host=localhost --port=5432 --dbname=postgres --username=postgres`
<br>with `-h localhost -p 5432 --d postgres -U postgres`

Since localhost, port=5432 and database postgres are defaults, the shortest way a connect is: 
<br>
`
psql -U postgres
`

In case `psql`issues a warning because of an **incorrect code page**, please execute on the `psql`command line:
<br>
`
\! chcp 1252
`

Execute `\l` (backslash ell) to **list all available databases** on the connected server.
<br> Leave psql by typing `\q` (quit).

### Create database and users

In [3]:
# select t1."bar" as "bar1", t1."beer" as "beer1", t1."price" as "price1", t2.* from "Sells" t1, "Sells" t2 where "price" = "price1" and "beer" != "beer1"

## SQL Magic in Jupyter

In [4]:
import sqlalchemy

In [7]:
#engine = sqlalchemy.create_engine("postgresql://env_master:M123xyz@localhost/env_db")
engine = sqlalchemy.create_engine("postgresql://env_master:xxxxxx@localhost/env_db")
engine

Engine(postgresql://env_master:***@localhost/env_db)

In [8]:
engine.connect()

#

In [9]:
%load_ext sql

In [10]:
#%sql postgresql://env_master:M123xyz@localhost/env_db
%sql postgresql://env_master:xxxxxx@localhost/env_db

'Connected: env_master@env_db'

In [11]:
%sql select * from "Sells"

 * postgresql://env_master:***@localhost/env_db
4 rows affected.

[('Joes', 'Bud', Decimal('2.50')),
 ('Joes', 'Miller', Decimal('2.75')),
 ('Sues', 'Bud', Decimal('2.50')),
 ('Sues', 'Coors', Decimal('3.00'))]

In [12]:
%%sql
select t1."bar" as "bar1", t1."beer" as "beer1", t1."price" as "price1", t2."bar" as "bar", t2."beer" as "beer", t2."price" as "price" 
from "Sells" t1, "Sells" t2 where t2."price" = t1."price" and t2."beer" != t1."beer";

 * postgresql://env_master:***@localhost/env_db
0 rows affected.

[]

In [13]:
%%sql
select t1.*, t2.* 
from "Sells" t1, "Sells" t2 where t2."price" = t1."price"

 * postgresql://env_master:***@localhost/env_db
6 rows affected.

[('Joes', 'Bud', Decimal('2.50'), 'Sues', 'Bud', Decimal('2.50')),
 ('Joes', 'Bud', Decimal('2.50'), 'Joes', 'Bud', Decimal('2.50')),
 ('Joes', 'Miller', Decimal('2.75'), 'Joes', 'Miller', Decimal('2.75')),
 ('Sues', 'Bud', Decimal('2.50'), 'Sues', 'Bud', Decimal('2.50')),
 ('Sues', 'Bud', Decimal('2.50'), 'Joes', 'Bud', Decimal('2.50')),
 ('Sues', 'Coors', Decimal('3.00'), 'Sues', 'Coors', Decimal('3.00'))]

In [14]:
%%sql
select * from "Sells"

 * postgresql://env_master:***@localhost/env_db
4 rows affected.

[('Joes', 'Bud', Decimal('2.50')),
 ('Joes', 'Miller', Decimal('2.75')),
 ('Sues', 'Bud', Decimal('2.50')),
 ('Sues', 'Coors', Decimal('3.00'))]

In [15]:
%%sql
select * from "Bars"

 * postgresql://env_master:***@localhost/env_db
2 rows affected.

[('Joes', 'Maple St.'), ('Sues', 'River Rd.')]

In [16]:
%%sql
select * from "Sells" natural join (select name as bar, addr from "Bars") as t2

 * postgresql://env_master:***@localhost/env_db
4 rows affected.

[('Joes', 'Miller', Decimal('2.75'), 'Maple St.'),
 ('Joes', 'Bud', Decimal('2.50'), 'Maple St.'),
 ('Sues', 'Coors', Decimal('3.00'), 'River Rd.'),
 ('Sues', 'Bud', Decimal('2.50'), 'River Rd.')]

In [17]:
%%sql
select * from "Sells" inner join "Bars" 
on "Sells"."bar" = "Bars"."name"

 * postgresql://env_master:***@localhost/env_db
4 rows affected.

[('Joes', 'Miller', Decimal('2.75'), 'Joes', 'Maple St.'),
 ('Joes', 'Bud', Decimal('2.50'), 'Joes', 'Maple St.'),
 ('Sues', 'Coors', Decimal('3.00'), 'Sues', 'River Rd.'),
 ('Sues', 'Bud', Decimal('2.50'), 'Sues', 'River Rd.')]

In [18]:
%%sql
select * from "Sells" inner join "Bars" 
on bar = name

 * postgresql://env_master:***@localhost/env_db
4 rows affected.

[('Joes', 'Miller', Decimal('2.75'), 'Joes', 'Maple St.'),
 ('Joes', 'Bud', Decimal('2.50'), 'Joes', 'Maple St.'),
 ('Sues', 'Coors', Decimal('3.00'), 'Sues', 'River Rd.'),
 ('Sues', 'Bud', Decimal('2.50'), 'Sues', 'River Rd.')]

In [19]:
%%sql
select * from "Sells", "Bars"
where bar = name

 * postgresql://env_master:***@localhost/env_db
4 rows affected.

[('Joes', 'Miller', Decimal('2.75'), 'Joes', 'Maple St.'),
 ('Joes', 'Bud', Decimal('2.50'), 'Joes', 'Maple St.'),
 ('Sues', 'Coors', Decimal('3.00'), 'Sues', 'River Rd.'),
 ('Sues', 'Bud', Decimal('2.50'), 'Sues', 'River Rd.')]

In [20]:
%%sql
select * from "Sells" t1, "Sells" t2
where t1.bar != t2.bar
and t1.beer = t2.beer

 * postgresql://env_master:***@localhost/env_db
2 rows affected.

[('Joes', 'Bud', Decimal('2.50'), 'Sues', 'Bud', Decimal('2.50')),
 ('Sues', 'Bud', Decimal('2.50'), 'Joes', 'Bud', Decimal('2.50'))]

In [21]:
%%sql
select * from "Sells" t1, "Sells" t2
where t1.bar != t2.bar
and t1.price = t2.price

 * postgresql://env_master:***@localhost/env_db
2 rows affected.

[('Joes', 'Bud', Decimal('2.50'), 'Sues', 'Bud', Decimal('2.50')),
 ('Sues', 'Bud', Decimal('2.50'), 'Joes', 'Bud', Decimal('2.50'))]